src/main/resources/static/wsdl/jaxws-service.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e. -->
<definitions
        xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://service.jaxws.soap.giophub.com/"
        xmlns="http://schemas.xmlsoap.org/wsdl/"
        targetNamespace="http://service.jaxws.soap.giophub.com/" name="SoapServiceImplService">
    <import namespace="http://contract.service.jaxws.soap.giophub.com/"
            location="http://localhost:8081/JaxWsSoapService?wsdl=1"></import>
    <binding xmlns:ns1="http://contract.service.jaxws.soap.giophub.com/" name="SoapServiceImplPortBinding"
             type="ns1:SoapService">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"></soap:binding>
        <operation name="sayHello">
            <soap:operation soapAction=""></soap:operation>
            <input>
                <soap:body use="literal"></soap:body>
            </input>
            <output>
                <soap:body use="literal"></soap:body>
            </output>
        </operation>
        <operation name="HelloWorld">
            <soap:operation soapAction=""></soap:operation>
            <input>
                <soap:body use="literal"></soap:body>
            </input>
            <output>
                <soap:body use="literal"></soap:body>
            </output>
        </operation>
    </binding>
    <service name="SoapServiceImplService">
        <port name="SoapServiceImplPort" binding="tns:SoapServiceImplPortBinding">
            <soap:address location="http://localhost:8081/JaxWsSoapService"></soap:address>
        </port>
    </service>
</definitions>